# 1. **Перевірка паролю:**
#    Завдання: Напишіть програму, яка встановлює початковий пароль і перевіряє, чи введений користувачем пароль 
# співпадає з ним. Якщо пароль дорівнює "password123", виведіть повідомлення "Ви увійшли в систему". 
# В іншому випадку виведіть повідомлення "Неправильний пароль".
from math import factorial

# password = 'password123'

# if 'password123' in password:
#     print("Ви увійшли в систему")
# else:
#     print("Неправильний пароль")

# 2. **Визначення днів тижня:**
#    Завдання: Створіть програму, яка встановлює номер дня тижня і виводить назву відповідного дня тижня. 
# Якщо номер дня недійсний (менше 1 або більше 7), виведіть повідомлення про помилку.

# days_dict = {
#     1 :"Monday",
#     2: "Thuesday",
#     3:"Wednesday",
#     4: "Thursday",
#     5:"Friday",
#     6: "Satturday",
#     7: "Sunday"
# }
# number = 10
#
# if number in days_dict.keys():
#     print(days_dict[number])
# elif number >=8 or number <= 0:
#         print('Number is wrong')
# else:
#     print('Something went wrong')
# ### Цикли:

# 1. **Таблиця множення:**
#    Завдання: Виведіть таблицю множення для заданого числа від 1 до 10.

# a = 0
#
# while a < 10:
#     a +=1
#     print(a * 1)
#     print(a * 2)
#     print(a * 3)
#     print(a * 4)
#     print(a * 5)
#     print(a * 6)
#     print(a * 7)
#     print(a * 8)
#     print(a * 9)
#     print(a * 10)
    

# 2. **Сума чисел:**
#    Завдання: Визначте список чисел і обчисліть їх суму.

# number_list = [1, 2]
#
# for num in number_list:
#     print(num + num)

# 3. **Факторіал числа:**
#    Завдання: Обчисліть факторіал заданого числа.
#
# num = 9
# print(factorial(num))

# 4. **Парні числа:**
#    Завдання: Виведіть всі парні числа від 1 до 50.

# a = 0;
# while a < 50:
#     a +=2
#     print(a)

# 5. **Пошук простих чисел:**
#    Завдання: Знайдіть всі прості числа в заданому діапазоні.

test_list = [3.14, 2, 4, 6, 7, 19.05]

for num in test_list:
    if type(num) == int:
        print(num)
