# ### Списки:
#
# 1. **Робота з списками:**
#    Завдання: Створіть список чисел. Додайте до списку числа 10 і 20, видаліть число 10 і
#    виведіть отриманий список.

# test_list = [1, 2, 3, 4, 5]
# test_list.append(10)
# test_list.append(20)
# test_list.remove(10)
# print(test_list)
#
# 2. **Знаходження суми:**
#    Завдання: Створіть список чисел. Знайдіть та виведіть суму всіх чисел у списку.
# a = [10, 30, 50]
# res = sum(a)
# print(res)
#
# 3. **Подвійні значення:**
#    Завдання: Створіть список чисел. Подвойте кожне число у списку та виведіть результат.
# b = [1, 5, 9]
# res = 2
# for num in b:
#  print(num * res)
#
# ### Кортежі:
#
# 1. **Робота із кортежами:**
#    Завдання: Створіть кортеж з трьох різних предметів, таких як
#    ("яблуко", "банан", "апельсин"). Виведіть кожен елемент кортежу окремо.
tuple = ("яблуко", "банан", "апельсин")
print(tuple[0], tuple[1], tuple[2])
#
# 2. **Об'єднання кортежів:**
#    Завдання: Створіть два кортежі з числами і об'єднайте їх у новий кортеж.
#    Виведіть отриманий кортеж.
c = (1, 5, 10)
d = (20, 40, 60)
resultTuple = c + d
print(resultTuple)
#
# ### Словники:
#
# 1. **Робота із словниками:**
#    Завдання: Створіть словник, що містить інформацію про вашого улюбленого спортсмена
#    (ім'я, вік, спорт, команда тощо). Виведіть цю інформацію на екран.
sport_dict = {
 "name": "Shewchenko",
 "age": 42,
 "sport": "soccer",
 "team": "Dynamo"
}
print(sport_dict)
#
# 2. **Оновлення словника:**
#    Завдання: Створіть словник, що містить ваші улюблені книги
#    (назва книги та рік видання). Додайте до словника нову улюблену книгу та
#    виведіть оновлений словник.
book_dict = {
 "Harry Potter": "1996",
 "Bone Watch": "2000"
}
new_book = {
 "let my people go": "2005"
}
book_dict.update(new_book)
print(book_dict)
#
# 3. **Пошук значення:**
#    Завдання: Створіть словник, що містить інформацію про країни та їх столиці.
#    Запитайте користувача про назву країни і виведіть столицю цієї країни
#    (якщо така країна є у словнику).
country_dict = {
 "Ukraine": "Kyiv",
 "France": "Rome"
}
print(country_dict["Ukraine"])
print(country_dict["France"])


